In [1]:
import pandas as pd
import numpy as np

In [5]:
a = np.arange(10)
b = np.append(a , [11])
print(b)

[ 0  1  2  3  4  5  6  7  8  9 11]

In [2]:
arr= np.arange(-10,10,1)
s = pd.Series(arr)
print(s)

0    -10
1     -9
2     -8
3     -7
4     -6
5     -5
6     -4
7     -3
8     -2
9     -1
10     0
11     1
12     2
13     3
14     4
15     5
16     6
17     7
18     8
19     9
dtype: int32

In [7]:
arr = np.array([23 , 25 , 27 , 31 , 32 ,19 , 31 , 18])
s=pd.Series(arr , index=[np.arange(8,16)])
print(s)

8     23
9     25
10    27
11    31
12    32
13    19
14    31
15    18
dtype: int32

In [8]:
print(s.values)
print(s.index)

[23 25 27 31 32 19 31 18]
MultiIndex([( 8,),
            ( 9,),
            (10,),
            (11,),
            (12,),
            (13,),
            (14,),
            (15,)],
           )

In [10]:
print(s[8])

23

__________________________________________
یک سری درست کنید که ایندکس های اون تاریخ باشند
__________________________________________

In [12]:
dates = np.arange('2021-08', '2021-09', dtype='datetime64[D]') 
arr = np.arange(60)
a= pd.Series(arr , index=dates)
print(a)

ValueError: Length of passed values is 60, index implies 31.

In [7]:
print(a['2021-08-08'])

7

__________________________
تعریف دیکشنری
__________________________

In [82]:
a = [1 , 2 , 4 , 5]
print(a)
print(type(a))
a[0]

[1, 2, 4, 5]
<class 'list'>

1

In [8]:
dict_arr = {'a': 1 , 'b':2 , 'c':3}
print(dict_arr.keys())
print(dict_arr['b'])

dict_keys(['a', 'b', 'c'])
2

In [83]:
dict_arr

{'a': 1, 'b': 2, 'c': 3}

__________________________
تعریف سری با استفاده از دیکشنری
__________________________

In [9]:
arr_dict=pd.Series(dict_arr ,index=['a' , 'b' , 'c' , 'd' , 'e'])
print(arr_dict)

a    1.0
b    2.0
c    3.0
d    NaN
e    NaN
dtype: float64

In [85]:
arr = np.array([23 , 25 , 27 , 31 , 31 , 18 , 19])
s=pd.Series(arr , index=[np.arange(8,16)])
print(s)

ValueError: Length of passed values is 7, index implies 8.

In [86]:
arr = np.array([23 , 25 , 27 , 31 , 32 ,19 , 31 , 18 , 19])
s=pd.Series(arr , index=[np.arange(8,17)])
print(s[4:7])

12    32
13    19
14    31
dtype: int32

In [11]:
s.loc[12:14]

12    32
13    19
14    31
dtype: int32

In [88]:
s.iloc[4:7]

12    32
13    19
14    31
dtype: int32

In [56]:
pd.Series([10 , 15, 20, 20 , 10, 11 , 8 , 0], name='A').unique()

array([10, 15, 20, 11,  8,  0], dtype=int64)

In [14]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6])
s3 = pd.Series([4, 5, 6], index=[3, 4, 5])
s4 = s1.append(s2)
print(s4)

0    1
1    2
2    3
0    4
1    5
2    6
dtype: int64

In [18]:
s4[0][0]

0    1
0    4
dtype: int64

In [20]:
s5 = s1.append(s3)

In [21]:
s5[0]

1

________________________
عملیات های مختلف بر روی سری
________________________

In [23]:
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e'])
print(data.add(data1))
print('____________')
print(data.add(data1, fill_value=0))

a     6.0
b     8.0
c     NaN
d    11.0
e     NaN
dtype: float64
____________
a     6.0
b     8.0
c     3.0
d    11.0
e     9.0
dtype: float64

In [24]:
print(data.transform(lambda x : x%2 ))

a    1
b    0
c    1
d    1
dtype: int64

In [66]:
data.agg(['min', 'max' , 'mean'])

min     2.00
max     7.00
mean    4.25
dtype: float64

In [26]:
data1= pd.Series(np.random.rand(100)*10)
print(data1)
print("_____________")
data = data1.between(2,3)
print(data)

0     7.119030
1     9.547847
2     2.501457
3     7.726379
4     0.971738
        ...
95    5.029356
96    4.131004
97    6.669544
98    0.062153
99    8.975705
Length: 100, dtype: float64
_____________
0     False
1     False
2      True
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

In [70]:
data1

0     0.628861
1     7.402710
2     2.665861
3     5.590845
4     0.302912
        ...
95    7.136364
96    1.629762
97    1.400807
98    2.369211
99    8.305168
Length: 100, dtype: float64

In [27]:
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e'])
print(data.add(data1))
print('____________')
print(data.add(data1, fill_value=0))

a     6.0
b     8.0
c     NaN
d    11.0
e     NaN
dtype: float64
____________
a     6.0
b     8.0
c     3.0
d    11.0
e     9.0
dtype: float64

In [99]:
print(data1)
print("____________")
print(data1.drop(['e']))
print("____________")
print(data1.drop(['a','e']))

a    1
b    6
d    4
e    9
dtype: int64
____________
a    1
b    6
d    4
dtype: int64
____________
b    6
d    4
dtype: int64

In [76]:
data2 = data1.drop(['e'])
print(data1)
print("_________")
print(data2)

a    1
b    6
d    4
e    9
dtype: int64
_________
a    1
b    6
d    4
dtype: int64

In [77]:
data2 = data1.pop('e')
print(data1)
print("_________")
print(data2)

a    1
b    6
d    4
dtype: int64
_________
9

_______________________
پیدا کردن مقادیر از دست رفته
_______________________

In [101]:
data3 = data.add(data1)
print(data3)
print("_______")
print(pd.isna(data3))
print("_______")
print(data3.notna())
print("_______")
print(data3.isin([6]))

a     6.0
b     8.0
c     NaN
d    11.0
e     NaN
dtype: float64
_______
a    False
b    False
c     True
d    False
e     True
dtype: bool
_______
a     True
b     True
c    False
d     True
e    False
dtype: bool
_______
a     True
b    False
c    False
d    False
e    False
dtype: bool

In [79]:
data3.dropna()

a     6.0
b     8.0
d    11.0
dtype: float64

________________________________________________________________
سری زیر را مورد بررسی قرار بدید و تعداد مقادیر از دست رفته آن را بشمارید
و تعداد علی های آن را بشمارید
________________________________________________________________

In [102]:
arr_s=pd.Series(['ali','reza' , 'hasan' , 'javad' , np.nan , 'mohsen' , 'javad', 'ali' , 'mohammad' , np.nan])
print(arr_s)

0         ali
1        reza
2       hasan
3       javad
4         NaN
5      mohsen
6       javad
7         ali
8    mohammad
9         NaN
dtype: object

In [104]:
print(sum(pd.isna(arr_s)))
print(sum(arr_s.isin(['ali'])))
print(arr_s.index)

2
2
RangeIndex(start=0, stop=10, step=1)

__________________________
DataFrame
__________________________

In [28]:
df = pd.DataFrame({
    'name': ['ali', 'mohsen', 'siamak', np.nan, 'reza', 'javad'],
    'age': [34, 30, 31, 32, 29, 33],
    'h': [178, 189, 167, 179, 181, 172],
    'po': ['دکتری', 'لیسانس', 'لیسانس', 'فوق لیسانس', 'لیسانس', 'فوق لیسانس']})

In [29]:
print(df)

     name  age    h          po
0     ali   34  178       دکتری
1  mohsen   30  189      لیسانس
2  siamak   31  167      لیسانس
3     NaN   32  179  فوق لیسانس
4    reza   29  181      لیسانس
5   javad   33  172  فوق لیسانس

In [30]:
df['name']

0       ali
1    mohsen
2    siamak
3       NaN
4      reza
5     javad
Name: name, dtype: object

In [31]:
df.loc[0:2]

     name  age    h      po
0     ali   34  178   دکتری
1  mohsen   30  189  لیسانس
2  siamak   31  167  لیسانس

In [114]:
df.iloc[1:5]

     name  age    h          po
1  mohsen   30  189      لیسانس
2  siamak   31  167      لیسانس
3     NaN   32  179  فوق لیسانس
4    reza   29  181      لیسانس

In [32]:
print(df.columns)

Index(['name', 'age', 'h', 'po'], dtype='object')

In [33]:
df.head(2)

     name  age    h      po
0     ali   34  178   دکتری
1  mohsen   30  189  لیسانس

In [132]:
print(df.index)
print(df.shape)
print(df.count())
print(df)

RangeIndex(start=0, stop=6, step=1)
(6, 4)
name    5
age     6
h       6
po      6
dtype: int64
     name  age    h          po
0     ali   34  178       دکتری
1  mohsen   30  189      لیسانس
2  siamak   31  167      لیسانس
3     NaN   32  179  فوق لیسانس
4    reza   29  181      لیسانس
5   javad   33  172  فوق لیسانس

In [61]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'), index=['x', 'y'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'), index=['x', 'y'])
df.append(df2)

   A  B
x  1  2
y  3  4
x  5  6
y  7  8

In [133]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [134]:
df1 = pd.DataFrame(np.random.randn(100, 4)*10,
                       columns=list('ABCD'),
                       index=pd.date_range('20210101', periods=100))
df1

                    A          B          C          D
2021-01-01 -20.271334 -16.857198   4.146629   4.763203
2021-01-02   3.669143   6.634424   8.360570  11.975280
2021-01-03   5.118890   2.156346  -8.854354 -15.237970
2021-01-04  -9.247972   6.457133 -10.801025  -3.099795
2021-01-05   4.337877  -5.649229  -8.789786   5.019387
...               ...        ...        ...        ...
2021-04-06  10.299367  -4.162581  16.029812 -11.151605
2021-04-07  -7.210233  -6.014700   4.491371   5.051674
2021-04-08   1.352949   7.285509   7.456260 -12.072288
2021-04-09   3.217414   5.602368  10.593166  -2.925806
2021-04-10  10.068063 -10.588595 -11.692128  -1.227056

[100 rows x 4 columns]

In [135]:
df1.head(10)

                    A          B          C          D
2021-01-01 -20.271334 -16.857198   4.146629   4.763203
2021-01-02   3.669143   6.634424   8.360570  11.975280
2021-01-03   5.118890   2.156346  -8.854354 -15.237970
2021-01-04  -9.247972   6.457133 -10.801025  -3.099795
2021-01-05   4.337877  -5.649229  -8.789786   5.019387
2021-01-06   2.563058  -8.890223  -3.616678  16.015467
2021-01-07 -30.295406  13.341057  -8.751755 -19.970370
2021-01-08   0.694321 -17.987113  -5.383524   3.685277
2021-01-09  -2.952723  -2.577835  -1.779288  21.779526
2021-01-10  15.389774   1.059627   2.349060 -13.367469

In [29]:
df1.loc[1:20]

TypeError: cannot do slice indexing on DatetimeIndex with these indexers [1] of type int

In [30]:
df1.iloc[0:20]

                    A          B          C          D
2021-01-01  19.552514   1.473305  -4.045961 -10.080164
2021-01-02 -18.722085   0.533599  -4.304536   8.673349
2021-01-03  11.152003  -6.029721  12.380799  -5.810095
2021-01-04  23.750284   2.310924  -5.410950  -1.300377
2021-01-05 -13.355226  -1.762447 -17.637648  12.828542
2021-01-06   0.834512  10.344397   6.409131   4.476242
2021-01-07   3.801160 -17.829965   1.703521   0.920503
2021-01-08  -1.151109   2.929387   1.746747  -6.509093
2021-01-09  -4.303596  22.078572   0.249082   9.818845
2021-01-10   1.652558  14.322018  -4.554888   7.050344
2021-01-11   4.648552   0.154762  -2.086237  -1.430246
2021-01-12  -9.096413   0.768831   2.211963  -3.864301
2021-01-13 -21.772237  -0.082105  -4.555953  18.951112
2021-01-14  16.955145  17.354168  -2.978802   8.477920
2021-01-15  -5.082364   5.939370   9.347464  -0.406849
2021-01-16  -6.799135  -5.534555   1.597054  11.955792
2021-01-17  10.946206 -17.779756   3.030554 -10.482657
2021-01-18  12.502974  -8.356752   2.803886  -3.999827
2021-01-19  16.269823 -11.445684   1.609071   5.269846
2021-01-20  -2.199504   5.448891  -1.965223   4.808695

In [31]:
df1.loc['2021-02-05']

A    -2.734634
B   -17.447153
C    16.985074
D    -0.594105
Name: 2021-02-05 00:00:00, dtype: float64

In [139]:
df1

                    A          B          C          D
2021-01-01 -20.271334 -16.857198   4.146629   4.763203
2021-01-02   3.669143   6.634424   8.360570  11.975280
2021-01-03   5.118890   2.156346  -8.854354 -15.237970
2021-01-04  -9.247972   6.457133 -10.801025  -3.099795
2021-01-05   4.337877  -5.649229  -8.789786   5.019387
...               ...        ...        ...        ...
2021-04-06  10.299367  -4.162581  16.029812 -11.151605
2021-04-07  -7.210233  -6.014700   4.491371   5.051674
2021-04-08   1.352949   7.285509   7.456260 -12.072288
2021-04-09   3.217414   5.602368  10.593166  -2.925806
2021-04-10  10.068063 -10.588595 -11.692128  -1.227056

[100 rows x 4 columns]

In [142]:
df1.iat[99,0]

10.068062893096812

In [143]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                  index=index)
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [34]:
new_index = ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10',
             'Chrome']
df1 = df.reindex(new_index)
df1

               http_status  response_time
Safari               404.0           0.07
Iceweasel              NaN            NaN
Comodo Dragon          NaN            NaN
IE10                 404.0           0.08
Chrome               200.0           0.02

In [35]:
df1.sort_values(['response_time'])

               http_status  response_time
Chrome               200.0           0.02
Safari               404.0           0.07
IE10                 404.0           0.08
Iceweasel              NaN            NaN
Comodo Dragon          NaN            NaN

__________________________________________
یک دیتا فریم 100 عضوی درست کنید که ایندکس ها تاریخ باشند و کالم ها به نام  ویژگی اول ویژگی دوم  نام گذازی بشند و در نهایت بر اساس ویژگی دوم مرتب شند
__________________________________________

In [154]:
df1 = pd.DataFrame(np.random.randn(100, 4)*10,
                       columns=list('abcd'),
                       index=pd.date_range('20210101', periods=100))
df1

                    a          b          c          d
2021-01-01  -3.082621   2.668697  -4.240333 -17.207142
2021-01-02 -15.895349  -8.227182  -5.364649 -19.632066
2021-01-03   7.484695   4.603287   1.588741  -9.223699
2021-01-04   9.492763 -20.315775   0.985499   1.813966
2021-01-05   0.019135   2.104867  -8.755293   8.417921
...               ...        ...        ...        ...
2021-04-06  -4.232897  -6.847062   7.456360  -9.064107
2021-04-07   0.631449  -7.845614  15.980392   2.807669
2021-04-08  -8.808209   1.085136  -0.562763   1.764146
2021-04-09   1.622012  -4.632651   6.800093   5.273932
2021-04-10  -1.422542   1.686519  -0.292793  11.638348

[100 rows x 4 columns]

In [148]:
df1.sort_values(['b'])

                    a          b          c          d
2021-03-23   8.564579 -26.606973   1.744603   5.415045
2021-02-26   2.616734 -25.537882   5.065426  16.905625
2021-03-27  -3.252915 -22.022290  -3.403213  13.842339
2021-02-08   0.150085 -20.890457   9.729466 -18.748153
2021-02-19   7.543462 -18.610662 -14.752778   2.878342
...               ...        ...        ...        ...
2021-02-05   2.264860  16.426277  13.616424 -20.800743
2021-02-24  -1.410672  16.630777 -10.667986  12.289036
2021-01-15   1.937632  16.644094 -17.205406   1.877214
2021-02-09  -4.315297  19.705769   5.319837  -9.667085
2021-03-28  10.005006  21.054356   9.435646   9.321505

[100 rows x 4 columns]

In [37]:
df1.apply(np.sqrt)

                   A         B         C         D
2021-01-01       NaN       NaN       NaN       NaN
2021-01-02       NaN  3.168091  1.708490       NaN
2021-01-03       NaN       NaN       NaN  0.964883
2021-01-04       NaN       NaN       NaN  2.461549
2021-01-05  1.817264       NaN       NaN       NaN
...              ...       ...       ...       ...
2021-04-06       NaN  2.616374       NaN  4.035138
2021-04-07  2.943191  1.026248  3.559914       NaN
2021-04-08  3.867245  2.826427  3.978687  3.740445
2021-04-09       NaN       NaN       NaN       NaN
2021-04-10       NaN       NaN       NaN       NaN

[100 rows x 4 columns]

In [38]:
df1.apply(np.exp)

                       A             B             C             D
2021-01-01  2.538294e-06  8.969178e-01  1.726238e-11  5.112789e-03
2021-01-02  1.415910e-02  2.285212e+04  1.852162e+01  1.886220e-13
2021-01-03  3.392574e-03  3.238988e-04  2.647514e-10  2.537042e+00
2021-01-04  9.732225e-03  1.720855e-04  3.295814e-03  4.280429e+02
2021-01-05  2.717914e+01  9.675574e-05  8.145590e-06  4.402031e-04
...                  ...           ...           ...           ...
2021-04-06  1.549034e-08  9.395611e+02  3.465236e-01  1.178501e+07
2021-04-07  5.781242e+03  2.866766e+00  3.190143e+05  1.423383e-17
2021-04-08  3.126991e+06  2.947424e+03  7.496501e+06  1.191742e+06
2021-04-09  8.658164e-01  2.515061e-04  1.985916e-04  6.914212e-01
2021-04-10  3.283466e-06  3.842334e-09  1.842309e-06  6.166653e-04

[100 rows x 4 columns]

In [152]:
a=str(5)
b =str(6)
a+b

'56'

In [39]:
df1.applymap(lambda x: str(x) + '_X')

,A,B,C,D
2021-01-01,-12.88401840444875_X,-0.10879106805707853_X,-24.782491799220566_X,-5.276010286140586_X
2021-01-02,-4.257397406419283_X,10.036799364858693_X,2.9189386561969766_X,-29.299031379812455_X
2021-01-03,-5.686166364275511_X,-8.035079340298317_X,-22.05222995258095_X,0.9309988124780972_X
2021-01-04,-4.632312686605105_X,-8.66751933088999_X,-5.715102205200329_X,6.059223345644159_X
2021-01-05,3.3024497597441678_X,-9.243320877393625_X,-11.718033851034718_X,-7.728274386880326_X
...,...,...,...,...
2021-04-06,-17.983049186806678_X,6.8454128102588605_X,-1.059804316008923_X,16.282338896492202_X
2021-04-07,8.662373766618035_X,1.0531846517306775_X,12.672991197178396_X,-38.79090980814912_X
2021-04-08,14.955581686996995_X,7.988686825924352_X,15.829946957209945_X,13.990926995962024_X
2021-04-09,-0.14408241442888264_X,-8.288043346610568_X,-8.524259933986615_X,-0.36900614685752336_X
2021-04-10,-12.626610975311666_X,-19.377185901654567_X,-13.204490862717467_X,-7.391184208080283_X

In [156]:
df1

                    a          b          c          d
2021-01-01  -3.082621   2.668697  -4.240333 -17.207142
2021-01-02 -15.895349  -8.227182  -5.364649 -19.632066
2021-01-03   7.484695   4.603287   1.588741  -9.223699
2021-01-04   9.492763 -20.315775   0.985499   1.813966
2021-01-05   0.019135   2.104867  -8.755293   8.417921
...               ...        ...        ...        ...
2021-04-06  -4.232897  -6.847062   7.456360  -9.064107
2021-04-07   0.631449  -7.845614  15.980392   2.807669
2021-04-08  -8.808209   1.085136  -0.562763   1.764146
2021-04-09   1.622012  -4.632651   6.800093   5.273932
2021-04-10  -1.422542   1.686519  -0.292793  11.638348

[100 rows x 4 columns]

In [159]:
df3 = df1['d']
df3

2021-01-01   -17.207142
2021-01-02   -19.632066
2021-01-03    -9.223699
2021-01-04     1.813966
2021-01-05     8.417921
                ...
2021-04-06    -9.064107
2021-04-07     2.807669
2021-04-08     1.764146
2021-04-09     5.273932
2021-04-10    11.638348
Freq: D, Name: d, Length: 100, dtype: float64

In [158]:
df2 = df1.drop(['d'],axis=1)
df2

                    a          b          c
2021-01-01  -3.082621   2.668697  -4.240333
2021-01-02 -15.895349  -8.227182  -5.364649
2021-01-03   7.484695   4.603287   1.588741
2021-01-04   9.492763 -20.315775   0.985499
2021-01-05   0.019135   2.104867  -8.755293
...               ...        ...        ...
2021-04-06  -4.232897  -6.847062   7.456360
2021-04-07   0.631449  -7.845614  15.980392
2021-04-08  -8.808209   1.085136  -0.562763
2021-04-09   1.622012  -4.632651   6.800093
2021-04-10  -1.422542   1.686519  -0.292793

[100 rows x 3 columns]

In [41]:
df1.drop(columns=['B', 'C'])

                    A          D
2021-01-01 -12.884018  -5.276010
2021-01-02  -4.257397 -29.299031
2021-01-03  -5.686166   0.930999
2021-01-04  -4.632313   6.059223
2021-01-05   3.302450  -7.728274
...               ...        ...
2021-04-06 -17.983049  16.282339
2021-04-07   8.662374 -38.790910
2021-04-08  14.955582  13.990927
2021-04-09  -0.144082  -0.369006
2021-04-10 -12.626611  -7.391184

[100 rows x 2 columns]

In [161]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D'])
print(df)
print("__________")
df.drop([2,0])

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
__________

   A  B  C  D
1  4  5  6  7

In [43]:
df2 = df1.apply(np.sqrt)
df2

                   A         B         C         D
2021-01-01       NaN       NaN       NaN       NaN
2021-01-02       NaN  3.168091  1.708490       NaN
2021-01-03       NaN       NaN       NaN  0.964883
2021-01-04       NaN       NaN       NaN  2.461549
2021-01-05  1.817264       NaN       NaN       NaN
...              ...       ...       ...       ...
2021-04-06       NaN  2.616374       NaN  4.035138
2021-04-07  2.943191  1.026248  3.559914       NaN
2021-04-08  3.867245  2.826427  3.978687  3.740445
2021-04-09       NaN       NaN       NaN       NaN
2021-04-10       NaN       NaN       NaN       NaN

[100 rows x 4 columns]

___________________
CSV
exel
json
___________________

In [115]:
data = pd.read_csv("C:\\Users\\khorshidsoft\\Desktop\\data\\nba.csv")

In [167]:
print(type(data))
data.head(10)

<class 'pandas.core.frame.DataFrame'>

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [168]:
data

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [169]:
data.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [119]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [122]:
data.corr(method='pearson')

          Number       Age    Weight    Salary
Number  1.000000  0.028724  0.206921 -0.112386
Age     0.028724  1.000000  0.087183  0.213459
Weight  0.206921  0.087183  1.000000  0.138321
Salary -0.112386  0.213459  0.138321  1.000000

In [124]:
data.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [171]:
data1=pd.read_excel("C:\\Users\\khorshidsoft\\Desktop\\data\\Summer-Olympic-medals-1976-to-2008.xlsx")

In [173]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15433 entries, 0 to 15432
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   City          15316 non-null  object
 1   Year          15316 non-null  float64
 2   Sport         15316 non-null  object
 3   Discipline    15316 non-null  object
 4   Event         15316 non-null  object
 5   Athlete       15316 non-null  object
 6   Gender        15316 non-null  object
 7   Country_Code  15316 non-null  object
 8   Country       15316 non-null  object
 9   Event_gender  15316 non-null  object
 10  Medal         15316 non-null  object
dtypes: float64(1), object(10)
memory usage: 1.3+ MB

In [175]:
data1.corr(method='pearson')

      Year
Year   1.0

In [177]:
data1.describe()

               Year
count  15316.000000
mean    1993.620789
std       10.159851
min     1976.000000
25%     1984.000000
50%     1996.000000
75%     2004.000000
max     2008.000000

In [178]:
data3 = pd.read_json("C:\\Users\\khorshidsoft\\Desktop\\data\\data.json")

In [181]:
data3.describe()

       correlation
count  8422.000000
mean      0.246772
std       0.167046
min      -0.571522
25%       0.261132
50%       0.281075
75%       0.309919
max       0.556258

In [53]:
data1.columns

Index(['City', 'Year', 'Sport', 'Discipline', 'Event', 'Athlete', 'Gender',
       'Country_Code', 'Country', 'Event_gender', 'Medal'],
      dtype='object')

In [55]:
data1.head()

,City,Year,Sport,Discipline,Event,Athlete,Gender,Country_Code,Country,Event_gender,Medal
0,Montreal,1976.0,Aquatics,Diving,3m springboard,"KÖHLER, Christa",Women,GDR,East Germany,W,Silver
1,Montreal,1976.0,Aquatics,Diving,3m springboard,"KOSENKOV, Aleksandr",Men,URS,Soviet Union,M,Bronze
2,Montreal,1976.0,Aquatics,Diving,3m springboard,"BOGGS, Philip George",Men,USA,United States,M,Gold
3,Montreal,1976.0,Aquatics,Diving,3m springboard,"CAGNOTTO, Giorgio Franco",Men,ITA,Italy,M,Silver
4,Montreal,1976.0,Aquatics,Diving,10m platform,"WILSON, Deborah Keplar",Women,USA,United States,W,Bronze

In [184]:
data1['Medal']

0        Silver
1        Bronze
2          Gold
3        Silver
4        Bronze
          ...
15428    Bronze
15429      Gold
15430    Silver
15431      Gold
15432      Gold
Name: Medal, Length: 15433, dtype: object